cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "sanemat/font"
tap "smudge/smudge"

brew "git"
# brew "gitmoji"  # nodeの最新版を勝手に入れてくるので、一旦使用中止
brew "git-secrets"
# brew "heroku"
# brew "jq"
brew "mas"
brew "nightlight"
brew "rbenv"
brew "rename"
brew "ricty"
# brew "rsync"
brew "ruby-build"
brew "shellcheck"
# brew "tflint"
# brew "tfsec"
brew "tree"
brew "volta"
# brew "watch"
brew "wget"

cask "adobe-creative-cloud"
# cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "asana"
# cask "aws-vault"
cask "bettertouchtool"
cask "vnc-viewer"
cask "brave-browser"
cask "canva"
cask "cheatsheet"
# cask "clipy"
cask "deepl"
cask "discord"
cask "docker"
cask "duet"
cask "figma"
cask "firefox"
cask "goland"
cask "google-chrome"
cask "google-drive"
# cask "google-japanese-ime"
# cask "iterm2"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "raycast"
cask "microsoft-edge"
cask "ngrok"
cask "notion"
cask "postman"
# cask "rectangle"
cask "scroll-reverser"
# cask "simplenote"
# cask "skitch"
cask "slack"
cask "sourcetree"
cask "react-native-debugger"
# cask "readdle-spark"
cask "the-unarchiver"
cask "utm"
cask "visual-studio-code"
cask "warp"
cask "zoom"

# mas "BetterSnapTool", id: 417375580
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "Hidden Bar", id: 1452453066
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
# mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
# mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PicGIF Lite", id: 844918735
mas "RunCat", id: 1429033973
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
