tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "sanemat/font"
tap "shivammathur/php"
brew "git"
brew "neovim"
brew "pyenv"
brew "tmux"
brew "tree"
brew "volta"
brew "watch"
brew "sanemat/font/ricty"
brew "shivammathur/php/php@7.4"
cask "alt-tab"
cask "android-studio"
cask "appcleaner"
cask "box-drive"
cask "brave-browser"
cask "deepl"
cask "docker"
cask "duet"
cask "eqmac"
cask "fig"
cask "figma"
cask "google-drive"
cask "hiddenbar"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "microsoft-remote-desktop"
cask "ngrok"
cask "obs"
cask "postman"
cask "raycast"
cask "scroll-reverser"
cask "spotify"
cask "stoplight-studio"
cask "visual-studio-code"
cask "warp"
cask "zoom"
vscode "42Crunch.vscode-openapi"
vscode "Arjun.swagger-viewer"
vscode "bmewburn.vscode-intelephense-client"
vscode "cweijan.vscode-mysql-client2"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "janisdd.vscode-edit-csv"
vscode "mermade.openapi-lint"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "proohit.openapi-snippets"
vscode "redhat.vscode-yaml"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.LiveServer"
vscode "SimonSiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tomoki1207.pdf"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zobo.php-intellisense"
