tap "grishka/grishka"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "minacle/chntpw"
tap "oven-sh/bun"
tap "smudge/smudge"
brew "act"
brew "aria2"
brew "coreutils"
brew "libyaml"
brew "asdf"
brew "cabextract"
brew "cdrtools"
brew "curl"
brew "direnv"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "libtiff"
brew "fontforge"
brew "fzf"
brew "gh"
brew "git"
brew "git-secrets"
brew "mas"
brew "neofetch"
brew "neovim"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "rename"
brew "rust"
brew "screen"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vim"
brew "wakeonlan"
brew "watchman"
brew "wget"
brew "wimlib"
brew "zsh"
brew "minacle/chntpw/chntpw"
brew "oven-sh/bun/bun"
brew "smudge/smudge/nightlight"
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud", args: { appdir: "/Applications" }
cask "alt-tab", args: { appdir: "/Applications" }
cask "amazon-q"
cask "appcleaner", args: { appdir: "/Applications" }
cask "betterdisplay"
cask "bettertouchtool", args: { appdir: "/Applications" }
cask "brave-browser"
cask "canva", args: { appdir: "/Applications" }
cask "chatgpt"
cask "chromium", args: { appdir: "/Applications" }
cask "deepl", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "docker"
cask "duet", args: { appdir: "/Applications" }
cask "figma", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "google-drive", args: { appdir: "/Applications" }
cask "hiddenbar", args: { appdir: "/Applications" }
cask "iterm2"
cask "keyboardcleantool", args: { appdir: "/Applications" }
cask "microsoft-edge", args: { appdir: "/Applications" }
cask "monitorcontrol", args: { appdir: "/Applications" }
cask "ngrok", args: { appdir: "/Applications" }
cask "notion", args: { appdir: "/Applications" }
cask "notion-calendar"
cask "obs"
cask "postman", args: { appdir: "/Applications" }
cask "raycast", args: { appdir: "/Applications" }
cask "rectangle"
cask "scroll-reverser", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "sourcetree", args: { appdir: "/Applications" }
cask "the-unarchiver", args: { appdir: "/Applications" }
cask "todoist", args: { appdir: "/Applications" }
cask "vimr"
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "warp", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
mas "Disk Speed Test", id: 425264550
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PicGIF Lite", id: 844918735
mas "RunCat", id: 1429033973
mas "Spark Desktop", id: 6445813049
mas "TestFlight", id: 899247664
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "1password.op-vscode"
vscode "42crunch.vscode-openapi"
vscode "aeschli.vscode-css-formatter"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "arjun.swagger-viewer"
vscode "astro-build.astro-vscode"
vscode "be5invis.vscode-custom-css"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "glenn2223.live-sass"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "icrawl.discord-vscode"
vscode "james-yu.latex-workshop"
vscode "jebbs.markdown-extended"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mermade.openapi-lint"
vscode "mhutchie.git-graph"
vscode "morrislaptop.vscode-open-in-sourcetree"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "proohit.openapi-snippets"
vscode "redhat.vscode-yaml"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "seatonjiang.gitmoji-vscode"
vscode "shardulm94.trailing-spaces"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yusukehirao.vscode-markuplint"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zobo.php-intellisense"
